a = float(input('กรุณาใส่ส่วนสูงของคุณ(เซนติเมตร): '))
a = a/100
b = int(input('กรุณาใส่ส่วนน้ำหนักของคุณ(กิโลกรัม): '))
c = b/(a*a)

if c <= 18.5:
    print('ค่าBMIของคุณคือ', c, 'หมายความว่าคุณน้ำหนักน้อยเกินไป')

elif c > 18.5 and c < 25:
    print('ค่าBMIของคุณคือ', c, 'หมายความว่าคุณน้ำหนักอยู่ในเกณฑ์ปกติ')

elif c > 25 and c < 30:
    print('ค่าBMIของคุณคือ', c, 'หมายความว่าคุณน้ำหนักเกินเกณฑ์.')

elif c > 30:
    print('ค่าBMIของคุณคือ', c, 'หมายความว่าคุณอ้วน')

input('\nกด enter เพื่อออก.')
